Revit 2024 API
LanguageType Enumeration
 An enumerated type containing the supported Revit product languages.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum LanguageType
Visual Basic
Public Enumeration LanguageType
Visual C++
public enum class LanguageType
Members
Member name | Description
Unknown |  Unknown.
English_USA |  English USA.
German |  German.
Spanish |  Spanish.
French |  French.
Italian |  Italian.
Dutch |  Dutch.
Chinese_Simplified |  Chinese simplified.
Chinese_Traditional |  Chinese traditional.
Japanese |  Japanese.
Korean |  Korean.
Russian |  Russian.
Czech |  Czech.
Polish |  Polish.
Hungarian |  Hungarian.
Brazilian_Portuguese |  Brazilian Portuguese.
English_GB |  English - United Kingdom.
See Also
Autodesk.Revit.ApplicationServices Namespace